In [1]:
import pandas as pd
import numpy as np

In [15]:
dates = pd.date_range(start = '01/01/2020', end = '01/07/2020', periods = 6)
dates

# pd.date_range(start = '01/01/2020', end = '01/07/2020', periods = 6)

DatetimeIndex(['2020-01-01 00:00:00', '2020-01-02 04:48:00',
               '2020-01-03 09:36:00', '2020-01-04 14:24:00',
               '2020-01-05 19:12:00', '2020-01-07 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [17]:
dates1 = pd.date_range(end = '01/07/2020', periods = 6)
dates

DatetimeIndex(['2020-01-01 00:00:00', '2020-01-02 04:48:00',
               '2020-01-03 09:36:00', '2020-01-04 14:24:00',
               '2020-01-05 19:12:00', '2020-01-07 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [18]:
dates2 = pd.date_range(start = '01/01/2020', periods = 7, freq = '2M')
dates
# M = Months , D = Date

DatetimeIndex(['2020-01-01 00:00:00', '2020-01-02 04:48:00',
               '2020-01-03 09:36:00', '2020-01-04 14:24:00',
               '2020-01-05 19:12:00', '2020-01-07 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [16]:
pd.DataFrame(np.random.randn(6,4), index = dates, columns = list('ABCD'))

                            A         B         C         D
2020-01-01 00:00:00 -0.657151  0.230927  1.029422  3.230765
2020-01-02 04:48:00  1.568293  0.080954  0.856394  0.419465
2020-01-03 09:36:00  0.837168 -0.078529 -0.193995 -0.206239
2020-01-04 14:24:00  0.448824 -1.219830 -0.754142 -0.360605
2020-01-05 19:12:00  1.219134  1.368015 -0.491955  0.951863
2020-01-07 00:00:00  0.461385  1.822051  0.020073 -0.235299

In [2]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
pd.Series(mylist)

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
dtype: object

In [22]:
df = pd.DataFrame({'name': pd.Categorical(['raj', 'mukesh', 'aryan', 'raj','shyam', 'ram', 'prema', 'sneha', 'kia']), 
                           'l_name': ['kundra', 'kumar', 'sinha', 'verma', 'sharma', 'kohli', 'gulma', 'ahuja', 'jehak'],
                           'salary': np.array(['15000', '2000', '3471', '3721', '2344', '5342', '4589', '3432', '50003']),
                           'rating': pd.Categorical([2.3, 4.5, 5.0, 3.2, 4.5, 5, 3.4, 1.2, 4]),
                            'city': np.array(['delhi', 'mumbai', 'calcutta', 'delhi', 'pune', 'goa', 'andra-pradesh', 'goa', 'pune']),
                            'experience': [1, 3, 4, 5, 6, 2, 4.2, 7, 4]
                           })
display(df, df.dtypes)

     name  l_name salary rating           city  experience
0     raj  kundra  15000    2.3          delhi         1.0
1  mukesh   kumar   2000    4.5         mumbai         3.0
2   aryan   sinha   3471    5.0       calcutta         4.0
3     raj   verma   3721    3.2          delhi         5.0
4   shyam  sharma   2344    4.5           pune         6.0
5     ram   kohli   5342    5.0            goa         2.0
6   prema   gulma   4589    3.4  andra-pradesh         4.2
7   sneha   ahuja   3432    1.2            goa         7.0
8     kia   jehak  50003    4.0           pune         4.0

name          category
l_name          object
salary          object
rating        category
city            object
experience     float64
dtype: object

In [23]:
df.head()

     name  l_name salary rating      city  experience
0     raj  kundra  15000    2.3     delhi         1.0
1  mukesh   kumar   2000    4.5    mumbai         3.0
2   aryan   sinha   3471    5.0  calcutta         4.0
3     raj   verma   3721    3.2     delhi         5.0
4   shyam  sharma   2344    4.5      pune         6.0

In [24]:
df.tail(2)

    name l_name salary rating  city  experience
7  sneha  ahuja   3432    1.2   goa         7.0
8    kia  jehak  50003    4.0  pune         4.0

In [25]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [26]:
df.columns

Index(['name', 'l_name', 'salary', 'rating', 'city', 'experience'], dtype='object')

In [27]:
df.describe()

       experience
count    9.000000
mean     4.022222
std      1.872016
min      1.000000
25%      3.000000
50%      4.000000
75%      5.000000
max      7.000000

In [12]:
df.T

,0,1,2,3,4,5,6,7,8
name,raj,mukesh,aryan,raj,shyam,ram,prema,sneha,kia
l_name,kundra,kumar,sinha,verma,sharma,kohli,gulma,ahuja,jehak
salary,15000,2000,3471,3721,2344,5342,4589,3432,50003
rating,2.3,4.5,5,3.2,4.5,5,3.4,1.2,4
city,delhi,mumbai,calcutta,delhi,pune,goa,andra-pradesh,goa,pune
experience,1,3,4,5,6,2,4.2,7,4

In [28]:
df['name']

0       raj
1    mukesh
2     aryan
3       raj
4     shyam
5       ram
6     prema
7     sneha
8       kia
Name: name, dtype: category
Categories (8, object): [aryan, kia, mukesh, prema, raj, ram, shyam, sneha]

### iloc -> integer location based indexing
### data.iloc[row selection, column selection]
### data.loc[row selection, column selection]

In [29]:
df.iloc[0]

name             raj
l_name        kundra
salary         15000
rating           2.3
city           delhi
experience         1
Name: 0, dtype: object

In [30]:
df.iloc[1]
df.iloc[-1]

name            kia
l_name        jehak
salary        50003
rating            4
city           pune
experience        4
Name: 8, dtype: object

In [33]:
# cols
df.iloc[:, 1]  # first col

0    kundra
1     kumar
2     sinha
3     verma
4    sharma
5     kohli
6     gulma
7     ahuja
8     jehak
Name: l_name, dtype: object

In [34]:
df.iloc[:, -1] # last col

0    1.0
1    3.0
2    4.0
3    5.0
4    6.0
5    2.0
6    4.2
7    7.0
8    4.0
Name: experience, dtype: float64

In [36]:
# multiple indexing
df.iloc[0:3, 3]

0    2.3
1    4.5
2    5.0
Name: rating, dtype: category
Categories (7, float64): [1.2, 2.3, 3.2, 3.4, 4.0, 4.5, 5.0]

In [37]:
df.iloc[:, 0:3]

     name  l_name salary
0     raj  kundra  15000
1  mukesh   kumar   2000
2   aryan   sinha   3471
3     raj   verma   3721
4   shyam  sharma   2344
5     ram   kohli   5342
6   prema   gulma   4589
7   sneha   ahuja   3432
8     kia   jehak  50003

In [38]:
df.iloc[[1,2,3], [0,1,2]]

     name l_name salary
1  mukesh  kumar   2000
2   aryan  sinha   3471
3     raj  verma   3721

In [43]:
df1 = df.T
df1

,0,1,2,3,4,5,6,7,8
name,raj,mukesh,aryan,raj,shyam,ram,prema,sneha,kia
l_name,kundra,kumar,sinha,verma,sharma,kohli,gulma,ahuja,jehak
salary,15000,2000,3471,3721,2344,5342,4589,3432,50003
rating,2.3,4.5,5,3.2,4.5,5,3.4,1.2,4
city,delhi,mumbai,calcutta,delhi,pune,goa,andra-pradesh,goa,pune
experience,1,3,4,5,6,2,4.2,7,4

In [46]:
df1 = df.set_index('name')
df1

        l_name salary rating           city  experience
name
raj     kundra  15000    2.3          delhi         1.0
mukesh   kumar   2000    4.5         mumbai         3.0
aryan    sinha   3471    5.0       calcutta         4.0
raj      verma   3721    3.2          delhi         5.0
shyam   sharma   2344    4.5           pune         6.0
ram      kohli   5342    5.0            goa         2.0
prema    gulma   4589    3.4  andra-pradesh         4.2
sneha    ahuja   3432    1.2            goa         7.0
kia      jehak  50003    4.0           pune         4.0

In [49]:
df1.loc['raj', 'l_name']

name
raj    kundra
raj     verma
Name: l_name, dtype: object

In [50]:
df1.loc['raj', ['city', 'l_name', 'rating']]

       city  l_name rating
name
raj   delhi  kundra    2.3
raj   delhi   verma    3.2

In [52]:
# conditional loc statements
df.loc[df['city'] == 'andra-pradesh', ['rating', 'experience', 'name']]

  rating  experience   name
6    3.4         4.2  prema

In [54]:
df1.loc[:, ['city']]

                 city
name
raj             delhi
mukesh         mumbai
aryan        calcutta
raj             delhi
shyam            pune
ram               goa
prema   andra-pradesh
sneha             goa
kia              pune

In [55]:
x = 'py' 'th'
print(x)

pyth

In [65]:
import csv

In [3]:
# Automobile data

# load the data

df = pd.read_csv("C:\\Users\\admin\\Downloads\\python\\Automobile_data.csv")
df

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
...,...,...,...,...,...,...,...,...,...,...
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

In [4]:
df.head(5)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [5]:
df.tail(5)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

In [83]:
for num in range(2, 10):
    if num % 2 == 0:
        print("Found an even number", num)
        continue
    print("Found a number", num)

Found an even number 2
Found a number 3
Found an even number 4
Found a number 5
Found an even number 6
Found a number 7
Found an even number 8
Found a number 9

In [6]:
for n in range(2, 10):
    for x in range(2, n):
        if n % x == 0:
                print(n, 'equals', x, '*', n//x)
                break
        else:
            print(n, 'is a prime number')

3 is a prime number
4 equals 2 * 2
5 is a prime number
5 is a prime number
5 is a prime number
6 equals 2 * 3
7 is a prime number
7 is a prime number
7 is a prime number
7 is a prime number
7 is a prime number
8 equals 2 * 4
9 is a prime number
9 equals 3 * 3

In [10]:
df.columns

Index(['index', 'company', 'body-style', 'wheel-base', 'length', 'engine-type',
       'num-of-cylinders', 'horsepower', 'average-mileage', 'price'],
      dtype='object')

In [12]:
df.isna().sum()

index               0
company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               3
dtype: int64

In [22]:
na_rows = df[df['price'].isna()]
na_rows

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
22,31,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
23,32,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
47,63,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,NaN

In [34]:
# df = df.drop(23)
df.isna().sum()

index               0
company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               2
dtype: int64

In [93]:
na_rows = df[df['price'].isna()]
na_rows

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
22,31,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
47,63,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,NaN

In [45]:
df['company'].astype('category')

0       alfa-romero
1       alfa-romero
2       alfa-romero
3              audi
4              audi
5              audi
6              audi
7               bmw
8               bmw
9               bmw
10              bmw
11              bmw
12              bmw
13        chevrolet
14        chevrolet
15        chevrolet
16            dodge
17            dodge
18            honda
19            honda
20            honda
21            isuzu
22            isuzu
24           jaguar
25           jaguar
26           jaguar
27            mazda
28            mazda
29            mazda
30            mazda
31            mazda
32    mercedes-benz
33    mercedes-benz
34    mercedes-benz
35    mercedes-benz
36       mitsubishi
37       mitsubishi
38       mitsubishi
39       mitsubishi
40           nissan
41           nissan
42           nissan
43           nissan
44           nissan
45          porsche
46          porsche
47          porsche
48           toyota
49           toyota
50           toyota
51           toyota
52           toyota
53           toyota
54           toyota
55       volkswagen
56       volkswagen
57       volkswagen
58       volkswagen
59            volvo
60            volvo
Name: company, dtype: category
Categories (16, object): [alfa-romero, audi, bmw, chevrolet, ..., porsche, toyota, volkswagen, volvo]

In [7]:
# df.loc[:,['price', 'length', 'wheel-base', 'horsepower']].max()
df.loc[:].max()

index                  88
company             volvo
body-style          wagon
wheel-base          120.9
length              208.1
engine-type         rotor
num-of-cylinders      two
horsepower            288
average-mileage        47
price               45400
dtype: object

In [14]:
df[(df['engine-type'] == 'rotor')]
df.length.max()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61 entries, 0 to 60
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   index             61 non-null     int64
 1   company           61 non-null     object
 2   body-style        61 non-null     object
 3   wheel-base        61 non-null     float64
 4   length            61 non-null     object
 5   engine-type       61 non-null     object
 6   num-of-cylinders  61 non-null     object
 7   horsepower        61 non-null     int64
 8   average-mileage   61 non-null     int64
 9   price             58 non-null     float64
dtypes: float64(2), int64(3), object(5)
memory usage: 4.9+ KB

In [78]:
df.loc[df['price']>15000, ['company', 'body-style']]

          company   body-style
1     alfa-romero  convertible
2     alfa-romero    hatchback
4            audi        sedan
5            audi        sedan
6            audi        wagon
7             bmw        sedan
8             bmw        sedan
9             bmw        sedan
10            bmw        sedan
11            bmw        sedan
12            bmw        sedan
24         jaguar        sedan
25         jaguar        sedan
26         jaguar        sedan
31          mazda        sedan
32  mercedes-benz        sedan
33  mercedes-benz        wagon
34  mercedes-benz        sedan
35  mercedes-benz      hardtop
45        porsche      hardtop
46        porsche  convertible
54         toyota        wagon

In [79]:
df.describe()

,index,wheel-base,length,horsepower,average-mileage,price
count,60.000000,60.000000,60.000000,60.000000,60.000000,58.000000
mean,41.033333,98.548333,173.385000,108.483333,25.600000,15387.000000
std,25.617768,6.715287,13.958787,53.746893,8.040575,11320.259841
min,0.000000,88.400000,141.100000,48.000000,13.000000,5151.000000
25%,17.750000,94.500000,163.750000,68.000000,19.000000,6808.500000
50%,41.000000,96.400000,171.450000,100.000000,24.500000,11095.000000
75%,61.250000,101.400000,179.125000,123.000000,31.000000,18120.500000
max,88.000000,120.900000,208.100000,288.000000,47.000000,45400.000000

In [101]:
df[df['price']>45000]

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0

In [8]:
import pandas as pd
ser = pd.Series(data = [10,20,'CV',40,50], index = ['R', 'A', 'M', 'I', 'A'])
ser

# heterogenous datatypes unlike numpy

R    10
A    20
M    CV
I    40
A    50
dtype: object

In [5]:
ser.index

Index(['R', 'A', 'M', 'I', 'A'], dtype='object')

In [12]:
# ser['R']
ser.loc[['R', 'A']]

R    10
A    20
A    50
dtype: object

In [14]:
# multiple index locations
# ser[[3,2,0]] 
ser.iloc[[3,2]]

I    40
M    CV
dtype: object

In [15]:
# presence of index in series
'K' in ser

False

In [16]:
ser * 2

R      20
A      40
M    CVCV
I      80
A     100
dtype: object

In [19]:
ser[['I', 'R']] ** 2

I    1600
R     100
dtype: object

### DATAFRAMES

In [29]:
import numpy as np
d = {'one': pd.Series([1,2,3,4], ['apple', 'block', 'clock', 'cyril'] ),
    'two': pd.Series([33.4, 56.45, 7.6], ['apple', 'block', 'mazda'] )}
d

{'one': apple    1
 block    2
 clock    3
 cyril    4
 dtype: int64,
 'two': apple    33.40
 block    56.45
 mazda     7.60
 dtype: float64}

In [50]:
df = pd.DataFrame(d)
df

       one    two
apple  1.0  33.40
block  2.0  56.45
clock  3.0    NaN
cyril  4.0    NaN
mazda  NaN   7.60

In [31]:
df.index

Index(['apple', 'block', 'clock', 'cyril', 'mazda'], dtype='object')

In [32]:
df.columns

Index(['one', 'two'], dtype='object')

In [33]:
# create a subset df from d
pd.DataFrame(d, index = ['block', 'cyril', 'mazda'])

       one    two
block  2.0  56.45
cyril  4.0    NaN
mazda  NaN   7.60

In [ ]:
###### create a subset df from d
pd.DataFrame(d, columns = ['one', 'five'])

### Create dataframe from list of dictionaries

In [47]:
data = [{'box': 101, 'screw':'bolt'}, {'nail': 109, 'screw':801}]
data

[{'box': 101, 'screw': 'bolt'}, {'nail': 109, 'screw': 801}]

In [48]:
df = pd.DataFrame(data)
df

     box screw   nail
0  101.0  bolt    NaN
1    NaN   801  109.0

In [49]:
pd.DataFrame(data, index = ['orange', 'red'])

          box screw   nail
orange  101.0  bolt    NaN
red       NaN   801  109.0

### Basic Data Operations

In [52]:
df['three'] = df['one'] * df['two']

In [53]:
df

       one    two  three
apple  1.0  33.40   33.4
block  2.0  56.45  112.9
clock  3.0    NaN    NaN
cyril  4.0    NaN    NaN
mazda  NaN   7.60    NaN

In [54]:
df['fake'] = df['two']>2
df

       one    two  three   fake
apple  1.0  33.40   33.4   True
block  2.0  56.45  112.9   True
clock  3.0    NaN    NaN  False
cyril  4.0    NaN    NaN  False
mazda  NaN   7.60    NaN   True

##### df.pop can be stored in variable while del df can't

In [55]:
three = df.pop('three')
three

apple     33.4
block    112.9
clock      NaN
cyril      NaN
mazda      NaN
Name: three, dtype: float64

In [57]:
del df['two']
df

       one   fake
apple  1.0   True
block  2.0   True
clock  3.0  False
cyril  4.0  False
mazda  NaN   True

In [61]:
df.insert(2, 'copy_of_one', df['one'])
df

       one   fake  copy_of_one
apple  1.0   True          1.0
block  2.0   True          2.0
clock  3.0  False          3.0
cyril  4.0  False          4.0
mazda  NaN   True          NaN

In [60]:
# del df['copy_of_one']

In [62]:
df['new'] = df['fake'][:2]
df

       one   fake  copy_of_one   new
apple  1.0   True          1.0  True
block  2.0   True          2.0  True
clock  3.0  False          3.0   NaN
cyril  4.0  False          4.0   NaN
mazda  NaN   True          NaN   NaN

## Data Ingestion

##### Csv,json(javascript object notation),html,sql db